Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD51_DFP/3.0.29/Microchip.SAMD51_DFP.pdsc
      <condition id="ATSAMD51G18A">
         <require Dvendor="Microchip:3" Dname="ATSAMD51G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD51P20A">
         <require Dvendor="Microchip:3" Dname="ATSAMD51P20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD51G19A">
         <require Dvendor="Microchip:3" Dname="ATSAMD51G19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD51N20A">
         <require Dvendor="Microchip:3" Dname="ATSAMD51N20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD51N19A">
         <require Dvendor="Microchip:3" Dname="ATSAMD51N19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMD51J19A">
         <description>Headers and startup code for Microchip ATSAMD51J19A</description>
         <files>
            <file condition="C" category="include" name="samd51a/include"/>
            <file condition="C" category="header" name="samd51a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/gcc/startup_samd51j19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/system_samd51j19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd51a/gcc/gcc/samd51j19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd51a/gcc/gcc/samd51j19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/armcc/startup_samd51j19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/system_samd51j19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/iar/startup_samd51j19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/system_samd51j19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd51a/iar/iar/samd51j19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd51a/iar/iar/samd51j19a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMD51J18A">
         <description>Headers and startup code for Microchip ATSAMD51J18A</description>
         <files>
            <file condition="C" category="include" name="samd51a/include"/>
            <file condition="C" category="header" name="samd51a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/gcc/startup_samd51j18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/system_samd51j18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd51a/gcc/gcc/samd51j18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd51a/gcc/gcc/samd51j18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/armcc/startup_samd51j18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/system_samd51j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/iar/startup_samd51j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/system_samd51j18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd51a/iar/iar/samd51j18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd51a/iar/iar/samd51j18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMD51J20A">
         <description>Headers and startup code for Microchip ATSAMD51J20A</description>
         <files>
            <file condition="C" category="include" name="samd51a/include"/>
            <file condition="C" category="header" name="samd51a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/gcc/startup_samd51j20a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/system_samd51j20a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd51a/gcc/gcc/samd51j20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd51a/gcc/gcc/samd51j20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/armcc/startup_samd51j20a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/system_samd51j20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/iar/startup_samd51j20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/system_samd51j20a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd51a/iar/iar/samd51j20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd51a/iar/iar/samd51j20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMD51P19A">
         <description>Headers and startup code for Microchip ATSAMD51P19A</description>
         <files>
            <file condition="C" category="include" name="samd51a/include"/>
            <file condition="C" category="header" name="samd51a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/gcc/startup_samd51p19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/system_samd51p19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd51a/gcc/gcc/samd51p19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd51a/gcc/gcc/samd51p19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/armcc/startup_samd51p19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/system_samd51p19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/iar/startup_samd51p19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/system_samd51p19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd51a/iar/iar/samd51p19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd51a/iar/iar/samd51p19a_sram.icf" attr="config"/>
         </files>
      </component>
