Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD51_DFP/3.0.29/Microchip.SAMD51_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMD51G18A">
         <description>Headers and startup code for Microchip ATSAMD51G18A</description>
         <files>
            <file condition="C" category="include" name="samd51a/include"/>
            <file condition="C" category="header" name="samd51a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/gcc/startup_samd51g18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/system_samd51g18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd51a/gcc/gcc/samd51g18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd51a/gcc/gcc/samd51g18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/armcc/startup_samd51g18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/system_samd51g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/iar/startup_samd51g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/system_samd51g18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd51a/iar/iar/samd51g18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd51a/iar/iar/samd51g18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMD51P20A">
         <description>Headers and startup code for Microchip ATSAMD51P20A</description>
         <files>
            <file condition="C" category="include" name="samd51a/include"/>
            <file condition="C" category="header" name="samd51a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/gcc/startup_samd51p20a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/system_samd51p20a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd51a/gcc/gcc/samd51p20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd51a/gcc/gcc/samd51p20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/armcc/startup_samd51p20a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/system_samd51p20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/iar/startup_samd51p20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/system_samd51p20a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd51a/iar/iar/samd51p20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd51a/iar/iar/samd51p20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMD51G19A">
         <description>Headers and startup code for Microchip ATSAMD51G19A</description>
         <files>
            <file condition="C" category="include" name="samd51a/include"/>
            <file condition="C" category="header" name="samd51a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/gcc/startup_samd51g19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/system_samd51g19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd51a/gcc/gcc/samd51g19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd51a/gcc/gcc/samd51g19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/armcc/startup_samd51g19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/system_samd51g19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/iar/startup_samd51g19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/system_samd51g19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd51a/iar/iar/samd51g19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd51a/iar/iar/samd51g19a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMD51N20A">
         <description>Headers and startup code for Microchip ATSAMD51N20A</description>
         <files>
            <file condition="C" category="include" name="samd51a/include"/>
            <file condition="C" category="header" name="samd51a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/gcc/startup_samd51n20a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/system_samd51n20a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd51a/gcc/gcc/samd51n20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd51a/gcc/gcc/samd51n20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/armcc/startup_samd51n20a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/system_samd51n20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/iar/startup_samd51n20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/system_samd51n20a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd51a/iar/iar/samd51n20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd51a/iar/iar/samd51n20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMD51N19A">
         <description>Headers and startup code for Microchip ATSAMD51N19A</description>
         <files>
            <file condition="C" category="include" name="samd51a/include"/>
            <file condition="C" category="header" name="samd51a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd51a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd51a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/gcc/startup_samd51n19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd51a/gcc/system_samd51n19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd51a/gcc/gcc/samd51n19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd51a/gcc/gcc/samd51n19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/armcc/startup_samd51n19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd51a/armcc/system_samd51n19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/iar/startup_samd51n19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd51a/iar/system_samd51n19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd51a/iar/iar/samd51n19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd51a/iar/iar/samd51n19a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
